tutorials/wallHeatFluxHTCAxisymmetricJet/0.org/alphat
// Auto generated with dict2foam
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                |
| \      /  F ield         | OpenFOAM GUI Project: creativeFields           |
|  \    /   O peration     | Version:  0.8.9.0                                  |
|   \  /    A nd           | Web: www.c-fields.com                                       |
|    \/     M anipulation  |                                                |
\*---------------------------------------------------------------------------*/

FoamFile
{
    location    "0";
    version     2;
    class       volScalarField;
    object      alphat;
    format      ascii;
}

internalField    uniform 0.0;
dimensions       [1 -1 -1 0 0 0 0];

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 0.0;
    }
    
    heatedWall
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}



// ************************************************************************* //
