tutorials/wallHeatFluxHTCAxisymmetricJet/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

cp -rf 0.org 0

runApplication blockMesh
runApplication extrudeMesh

runApplication $application

#------------------------------------------------------------------------------
